###############################################################################
# Created by write_sdc
###############################################################################
current_design state_machine
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name __VIRTUAL_CLK__ -period 10.0000 
set_clock_uncertainty 0.2500 __VIRTUAL_CLK__
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {COMP_N}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {COMP_P}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {DAC_SETTLE_D}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {DEBUG_MUX[0]}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {DEBUG_MUX[1]}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {DEBUG_MUX[2]}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {DEBUG_MUX[3]}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {EN_OFFSET_CAL}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {RST_Z}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {SAMPLE_D}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {START}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VIN_N_SW_ON}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VIN_P_SW_ON}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {CLK_DATA}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {DAC_SETTLE}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {DATA[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {DATA[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {DATA[2]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {DATA[3]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {DATA[4]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {DATA[5]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {DEBUG_OUT}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {EN_COMP}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {EN_OFFSET_CAL_O}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {EN_VCM_SW_O}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {HI}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {LO}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {OFFSET_CAL_CYCLE}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {SAMPLE_O}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VCM_DUMMY_O}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VCM_O[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VCM_O[10]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VCM_O[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VCM_O[2]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VCM_O[3]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VCM_O[4]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VCM_O[5]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VCM_O[6]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VCM_O[7]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VCM_O[8]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VCM_O[9]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_N_O[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_N_O[10]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_N_O[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_N_O[2]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_N_O[3]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_N_O[4]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_N_O[5]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_N_O[6]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_N_O[7]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_N_O[8]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_N_O[9]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_P_O[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_P_O[10]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_P_O[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_P_O[2]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_P_O[3]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_P_O[4]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_P_O[5]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_P_O[6]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_P_O[7]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_P_O[8]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VREF_Z_P_O[9]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_N_O[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_N_O[10]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_N_O[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_N_O[2]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_N_O[3]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_N_O[4]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_N_O[5]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_N_O[6]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_N_O[7]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_N_O[8]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_N_O[9]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_P_O[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_P_O[10]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_P_O[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_P_O[2]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_P_O[3]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_P_O[4]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_P_O[5]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_P_O[6]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_P_O[7]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_P_O[8]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VSS_P_O[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1000 [get_ports {CLK_DATA}]
set_load -pin_load 0.1000 [get_ports {DAC_SETTLE}]
set_load -pin_load 0.1000 [get_ports {DEBUG_OUT}]
set_load -pin_load 0.1000 [get_ports {EN_COMP}]
set_load -pin_load 0.1000 [get_ports {EN_OFFSET_CAL_O}]
set_load -pin_load 0.1000 [get_ports {EN_VCM_SW_O}]
set_load -pin_load 0.1000 [get_ports {HI}]
set_load -pin_load 0.1000 [get_ports {LO}]
set_load -pin_load 0.1000 [get_ports {OFFSET_CAL_CYCLE}]
set_load -pin_load 0.1000 [get_ports {SAMPLE_O}]
set_load -pin_load 0.1000 [get_ports {VCM_DUMMY_O}]
set_load -pin_load 0.1000 [get_ports {DATA[5]}]
set_load -pin_load 0.1000 [get_ports {DATA[4]}]
set_load -pin_load 0.1000 [get_ports {DATA[3]}]
set_load -pin_load 0.1000 [get_ports {DATA[2]}]
set_load -pin_load 0.1000 [get_ports {DATA[1]}]
set_load -pin_load 0.1000 [get_ports {DATA[0]}]
set_load -pin_load 0.1000 [get_ports {VCM_O[10]}]
set_load -pin_load 0.1000 [get_ports {VCM_O[9]}]
set_load -pin_load 0.1000 [get_ports {VCM_O[8]}]
set_load -pin_load 0.1000 [get_ports {VCM_O[7]}]
set_load -pin_load 0.1000 [get_ports {VCM_O[6]}]
set_load -pin_load 0.1000 [get_ports {VCM_O[5]}]
set_load -pin_load 0.1000 [get_ports {VCM_O[4]}]
set_load -pin_load 0.1000 [get_ports {VCM_O[3]}]
set_load -pin_load 0.1000 [get_ports {VCM_O[2]}]
set_load -pin_load 0.1000 [get_ports {VCM_O[1]}]
set_load -pin_load 0.1000 [get_ports {VCM_O[0]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_N_O[10]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_N_O[9]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_N_O[8]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_N_O[7]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_N_O[6]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_N_O[5]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_N_O[4]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_N_O[3]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_N_O[2]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_N_O[1]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_N_O[0]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_P_O[10]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_P_O[9]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_P_O[8]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_P_O[7]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_P_O[6]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_P_O[5]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_P_O[4]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_P_O[3]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_P_O[2]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_P_O[1]}]
set_load -pin_load 0.1000 [get_ports {VREF_Z_P_O[0]}]
set_load -pin_load 0.1000 [get_ports {VSS_N_O[10]}]
set_load -pin_load 0.1000 [get_ports {VSS_N_O[9]}]
set_load -pin_load 0.1000 [get_ports {VSS_N_O[8]}]
set_load -pin_load 0.1000 [get_ports {VSS_N_O[7]}]
set_load -pin_load 0.1000 [get_ports {VSS_N_O[6]}]
set_load -pin_load 0.1000 [get_ports {VSS_N_O[5]}]
set_load -pin_load 0.1000 [get_ports {VSS_N_O[4]}]
set_load -pin_load 0.1000 [get_ports {VSS_N_O[3]}]
set_load -pin_load 0.1000 [get_ports {VSS_N_O[2]}]
set_load -pin_load 0.1000 [get_ports {VSS_N_O[1]}]
set_load -pin_load 0.1000 [get_ports {VSS_N_O[0]}]
set_load -pin_load 0.1000 [get_ports {VSS_P_O[10]}]
set_load -pin_load 0.1000 [get_ports {VSS_P_O[9]}]
set_load -pin_load 0.1000 [get_ports {VSS_P_O[8]}]
set_load -pin_load 0.1000 [get_ports {VSS_P_O[7]}]
set_load -pin_load 0.1000 [get_ports {VSS_P_O[6]}]
set_load -pin_load 0.1000 [get_ports {VSS_P_O[5]}]
set_load -pin_load 0.1000 [get_ports {VSS_P_O[4]}]
set_load -pin_load 0.1000 [get_ports {VSS_P_O[3]}]
set_load -pin_load 0.1000 [get_ports {VSS_P_O[2]}]
set_load -pin_load 0.1000 [get_ports {VSS_P_O[1]}]
set_load -pin_load 0.1000 [get_ports {VSS_P_O[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {COMP_N}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {COMP_P}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAC_SETTLE_D}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {EN_OFFSET_CAL}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {RST_Z}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SAMPLE_D}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {START}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {VIN_N_SW_ON}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {VIN_P_SW_ON}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DEBUG_MUX[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DEBUG_MUX[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DEBUG_MUX[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DEBUG_MUX[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
